---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DividedpathTotalPathLength
source: html/d367454b-0597-3b28-e737-9c9e8362d75d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DividedpathTotalPathLength Property

"Path Length"

## Syntax (C#)
```csharp
public static ForgeTypeId DividedpathTotalPathLength { get; }
```